[
  {
    "id": "1",
    "title": "India Announces New Climate Action Initiative at G20 Summit",
    "summary": "The Prime Minister announced India’s renewable energy plans and new measures to combat climate change at the G20 Summit.",
    "content": "At the G20 Summit held in New Delhi, Prime Minister Narendra Modi unveiled India’s ambitious plans to combat climate change. India has set a target of achieving 500 GW of renewable energy capacity by 2030. The initiative focuses on solar, wind, and hydrogen-based energy solutions. Leaders from across the world praised India’s move, calling it a major step in the global fight against climate change. The Prime Minister added that India is committed not only to fulfilling its own targets but also to helping other developing nations. The summit witnessed the participation of leaders from over 20 countries who discussed issues like climate action, economic development, and global health.",
    "image": "/images/g20-summit.jpg",
    "date": "2025-11-28",
    "category": "Politics",
    "slug": "india-g20-climate-initiative",
    "author": "Rajesh Kumar",
    "readingTime": "5 minutes"
  },
  {
    "id": "2",
    "title": "Indian Cricket Team Defeats Australia by 5 Wickets",
    "summary": "Brilliant innings from Virat Kohli and Rohit Sharma guided India to victory over Australia.",
    "content": "In a thrilling match played at the Melbourne Cricket Ground, the Indian cricket team defeated Australia by 5 wickets, taking a 2–1 lead in the series. Virat Kohli scored a stunning 112 runs, while Rohit Sharma added 89 runs. India chased down a target of 298 in 48.3 overs. Australian bowlers performed well initially, but the Kohli-Rohit partnership changed the course of the match. Jasprit Bumrah took 4 wickets, playing a crucial role in restricting Australia. This victory is significant for India, as it could become their third consecutive series win in Australia. The next match will be played in Sydney.",
    "image": "/images/cricket-match.jpg",
    "date": "2025-11-27",
    "category": "Sports",
    "slug": "india-beats-australia-cricket",
    "author": "Amit Sharma",
    "readingTime": "4 minutes"
  },
  {
    "id": "3",
    "title": "Indian Stock Market Soars, Sensex Jumps 500 Points",
    "summary": "Positive economic indicators and rising foreign investment boosted market sentiment.",
    "content": "At the Mumbai Stock Exchange, the Sensex surged 500 points and crossed the 75,000 mark today. The Nifty also gained 150 points to close at 22,800. Strong buying was seen in the IT, banking, and auto sectors. TCS, Infosys, HDFC Bank, and Reliance were among the top gainers. Analysts say that foreign institutional investors (FIIs) invested ₹5,000 crore in the past week. India’s GDP growth is expected to be around 7.2%, which has boosted investor confidence. However, concerns around global market volatility and inflation persist. Experts advise investors to adopt a long-term strategy.",
    "image": "/images/stock-market.jpg",
    "date": "2025-11-27",
    "category": "Business",
    "slug": "sensex-rises-500-points",
    "author": "Priya Verma",
    "readingTime": "3 minutes"
  },
  {
    "id": "4",
    "title": "Bollywood Star’s New Film Breaks All Box Office Records",
    "summary": "Shah Rukh Khan’s 'Pathaan 2' earns ₹100 crore on opening day.",
    "content": "Shah Rukh Khan’s latest film 'Pathaan 2' has created a storm at the box office, earning ₹100 crore on its opening day—marking the biggest opening for any Hindi film. Co-starring Deepika Padukone and John Abraham, the action thriller has been praised by both audiences and critics. Directed by Siddharth Anand, the film is part of Yash Raj Films’ spy universe. Experts predict the film could earn ₹500 crore in its first week. Shah Rukh Khan said that this was one of the most challenging projects of his career. The film is packed with high-intensity action sequences and an emotionally engaging storyline.",
    "image": "/images/bollywood-movie.jpg",
    "date": "2025-11-26",
    "category": "Entertainment",
    "slug": "pathaan-2-box-office-record",
    "author": "Neha Singh",
    "readingTime": "4 minutes"
  },
  {
    "id": "5",
    "title": "India Successfully Launches Chandrayaan-4 Mission",
    "summary": "ISRO launches Chandrayaan-4 to collect samples from the Moon’s south pole.",
    "content": "The Indian Space Research Organisation (ISRO) successfully launched the Chandrayaan-4 mission from Sriharikota today. The mission aims to collect soil and rock samples from the Moon’s south pole and return them to Earth—India’s first-ever sample return mission. Following the success of Chandrayaan-3, this marks another major leap for India’s space program. The mission involves two rocket launches: one for the lander and rover, and the second for the return module. Scientists believe the south pole may contain frozen water and valuable minerals. The mission will provide crucial data for future human lunar expeditions. The Prime Minister congratulated ISRO scientists, calling it a historic milestone in India’s space journey.",
    "image": "/images/chandrayaan-4.jpg",
    "date": "2025-11-26",
    "category": "Tech",
    "slug": "chandrayaan-4-launch-success",
    "author": "Dr. Vikas Mehta",
    "readingTime": "6 minutes"
  },
  {
    "id": "6",
    "title": "Delhi's Air Pollution Reaches ‘Severe’ Category",
    "summary": "AQI crosses 400; schools shut and construction halted across the capital.",
    "content": "Air pollution levels in Delhi and the NCR region have risen dangerously, with the AQI crossing 400—classified as 'severe'. The Delhi government has imposed emergency measures: all schools have been closed and construction activities have been completely banned. Authorities urged residents to stay indoors and wear masks if stepping outside. Doctors warned that pollution at this level can trigger respiratory illnesses, heart diseases, and other health complications. Environmental experts attribute the pollution to stubble burning, vehicular emissions, and industrial pollutants. The Supreme Court has demanded immediate action from the government.",
    "image": "/images/delhi-pollution.jpg",
    "date": "2025-11-25",
    "category": "Trending",
    "slug": "delhi-air-pollution-severe",
    "author": "Sanjay Gupta",
    "readingTime": "4 minutes"
  },
  {
    "id": "7",
    "title": "India and US Sign $10 Billion Defence Agreement",
    "summary": "Both nations agree to strengthen defense cooperation and conduct joint military exercises.",
    "content": "India and the United States signed a massive $10 billion defence agreement in New Delhi. The deal includes the purchase of advanced drones, fighter jets, and naval ships. The Defence Minister said the agreement will significantly strengthen India’s military capabilities and enhance regional security. Both countries also agreed to expand joint military exercises and technological collaboration. The US Defence Secretary described India as a key defense partner and praised its role in maintaining stability in the Indo-Pacific region. Experts believe this deal is crucial amid growing concerns over China’s aggression.",
    "image": "/images/india-us-defense.jpg",
    "date": "2025-11-25",
    "category": "Politics",
    "slug": "india-us-defense-deal",
    "author": "Arun Tripathi",
    "readingTime": "5 minutes"
  },
  {
    "id": "8",
    "title": "Virat Kohli Becomes Most Expensive Player in IPL 2026 Auction",
    "summary": "Mumbai Indians buy Kohli for ₹25 crore—the highest deal in IPL history.",
    "content": "In the IPL 2026 mega auction held in Dubai, Virat Kohli emerged as the most expensive player. The Mumbai Indians purchased him for ₹25 crore, marking the biggest deal in IPL history. After years with Royal Challengers Bangalore, this is Kohli’s first-ever franchise switch. Mumbai’s management said Kohli’s experience and leadership will be invaluable. Other major buys included Rohit Sharma (CSK, ₹20 crore), Jasprit Bumrah (Delhi Capitals, ₹18 crore), and Rashid Khan (KKR, ₹16 crore). Young Indian players like Yashasvi Jaiswal and Shubman Gill also attracted strong bids. IPL 2026 will feature 12 teams for the first time.",
    "image": "/images/ipl-auction.jpg",
    "date": "2025-11-24",
    "category": "Sports",
    "slug": "virat-kohli-ipl-auction-record",
    "author": "Karan Malhotra",
    "readingTime": "4 minutes"
  },
  {
    "id": "9",
    "title": "India Records 7.5% GDP Growth, Fastest in the World",
    "summary": "Government data shows India’s economy grew at 7.5% in the last quarter.",
    "content": "According to the Central Statistics Office, India’s GDP grew by 7.5% in the July–September quarter, making it the fastest-growing major economy in the world. The manufacturing sector registered 9.2% growth, while services grew by 8.1%. The Finance Minister said the numbers reflect the success of India’s economic policies. However, the agriculture sector grew only 2.8%, raising concerns. The World Bank and IMF have raised India’s growth forecast to 7.3%. Economists cite infrastructure investment, digitization, and a thriving startup ecosystem as major drivers. The government aims to make India a $7 trillion economy by 2030.",
    "image": "/images/gdp-growth.jpg",
    "date": "2025-11-24",
    "category": "Business",
    "slug": "india-gdp-growth-fastest",
    "author": "Dr. Anil Kumar",
    "readingTime": "5 minutes"
  },
  {
    "id": "10",
    "title": "India Crosses 500 Million 5G Users",
    "summary": "Rapid expansion by telecom companies has driven 5G adoption across India.",
    "content": "The number of 5G users in India has crossed 500 million, just 18 months after launch. Jio and Airtel have rapidly expanded 5G networks across the country, now covering more than 500 cities. The Telecom Minister said India is now among the world’s leading nations in 5G adoption. High speeds and low latency have boosted smart city initiatives, telemedicine, online education, and IoT applications. Experts estimate that India could reach 1 billion 5G users by 2026. The government is also working on 6G technology, aiming for a rollout by 2030. Indian companies are investing in local manufacturing of telecom equipment and chipsets.",
    "image": "/images/5g-users.jpg",
    "date": "2025-11-23",
    "category": "Tech",
    "slug": "india-5g-users-500-million",
    "author": "Ravi Shankar",
    "readingTime": "4 minutes"
  },
  {
    "id": "11",
    "title": "Heavy Rainfall Disrupts Local Train Services in Mumbai",
    "summary": "Weather department issues heavy rainfall alert for the next 48 hours.",
    "content": "Heavy rainfall in Mumbai and nearby regions has severely impacted daily life. Local train services were disrupted, and several areas experienced waterlogging. The weather department has issued a heavy-to-very-heavy rainfall alert for the next 48 hours. The BMC urged residents to stay indoors. Schools and colleges have been closed. Mumbai Police activated emergency helplines. NDRF teams were deployed for rescue operations. Some regions recorded more than 200 mm of rainfall in the last 24 hours. Experts say climate change is increasing extreme weather events in Mumbai. The government has announced a ₹5,000 crore project to upgrade the city's drainage infrastructure.",
    "image": "/images/mumbai-rain.jpg",
    "date": "2025-11-23",
    "category": "Trending",
    "slug": "mumbai-heavy-rain-disruption",
    "author": "Meena Patel",
    "readingTime": "3 minutes"
  },
  {
    "id": "12",
    "title": "Indian Startups Raise $30 Billion in Funding in 2025",
    "summary": "India now has over 100 unicorn companies, making it one of the fastest-growing startup ecosystems.",
    "content": "Indian startups raised a total of $30 billion in 2025, a 40% increase from last year. India is now home to more than 100 unicorns valued at over $1 billion each. The highest funding activity was seen in fintech, e-commerce, edtech, and healthtech. Bengaluru, Delhi, and Mumbai continue to dominate as startup hubs. The 'Startup India' initiative has accelerated entrepreneurship across the nation. The Commerce Minister said India is on track to becoming the world’s third-largest startup ecosystem by 2030. Major investors include SoftBank, Sequoia Capital, and Tiger Global. Despite strong growth, challenges like funding winter and valuation corrections persist. Experts advise startups to prioritize profitability.",
    "image": "/images/startup-funding.jpg",
    "date": "2025-11-22",
    "category": "Business",
    "slug": "indian-startups-funding-record",
    "author": "Siddharth Rao",
    "readingTime": "5 minutes"
  }
]
